// Сколько зерен на доске

// Когда создатель шахмат, древнеиндийский мудрец и математик Сисса бен Дахир,
// показал своё изобретение Правителю страны, тому так понравилась игра, что он
// позволил изобретателю право самому выбрать награду. Мудрец попросил у Повелителя
// за первую клетку шахматной доски заплатить ему одно зерно риса, за второе — два,
// за третье — четыре и т. д., удваивая количество зёрен на каждой следующей клетке.
// Помоги повелителю сосчитать сколько зерен на какой клетке лежит.
// Необходимо составить функцию, которая определяет, сколько зерен попросил положить
// на N-ую клетку изобретатель шахмат (на 1-ую – 1 зерно, на 2-ую – 2 зерна,
// на 3-ю – 4 зерна, …)

// Input format
// Цлое число от 1 до 64

// Output format
// Одно целое число. Количество зерен на данной клетке.

#include <stdio.h>

int main(int argc, char **argv)
{
    int number = 0;
    unsigned long long res = 1;

    if (scanf("%d", &number) != 1 || number >= 65 || number <= 0)
    {
        printf("Input error.\n");
        return 0;
    }
    if (number == 1)
    {
        printf("1\n");
        return 0;
    }

    for (int i = 2; i <= number; i++)
    {
        res *= 2;
    }
    printf("%llu\n", res);
    return 0;
}
